In [1]:
# Data Visualization
# BTech Computer Science Stream
# Week 4: pandas and data handling
# Kenneth Francis Rodrigues, 240905112, 3/1/2025

In [2]:
# Problem 1
# 1. Create a Series from a list of integers representing daily
# temperatures (in Celsius) over a week. Assign index labels as day
# of the week.
# a. Find and print the average (mean) temperature for the week.
# b. Identify and print the maximum and minimum temperatures
# and their respective days.
# c. Display the temperatures greater than a specific value.
# d. Convert all temperatures to Fahrenheit.
# e. Print the days had temperatures above the average.

In [3]:
import pandas as pd

In [4]:
temperatures = [23, 27, 31, 15, 25, 5, 19]
days = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
temperature_series = pd.Series(temperatures, index=days)
temperature_series

Monday       23
Tuesday      27
Wednesday    31
Thursday     15
Friday       25
Saturday      5
Sunday       19
dtype: int64

In [5]:
average_temp = temperature_series.mean()
print(f"Average temperature for the week: {average_temp}°C")

Average temperature for the week: 20.714285714285715°C

In [6]:
max_temp = temperature_series.max()
max_temp_day = temperature_series.idxmax()
min_temp = temperature_series.min()
min_temp_day = temperature_series.idxmin()
print(f"Maximum temperature: {max_temp}°C on {max_temp_day}")
print(f"Minimum temperature: {min_temp}°C on {min_temp_day}")

Maximum temperature: 31°C on Wednesday
Minimum temperature: 5°C on Saturday

In [7]:
temperatures_above_value = temperature_series[temperature_series > 23]
print('Temperatures greater than 23°C')
temperatures_above_value

Temperatures greater than 23°C

Tuesday      27
Wednesday    31
Friday       25
dtype: int64

In [8]:
temperature_series_fahrenheit = (temperature_series * 9/5) + 32
temperature_series_fahrenheit

Monday       73.4
Tuesday      80.6
Wednesday    87.8
Thursday     59.0
Friday       77.0
Saturday     41.0
Sunday       66.2
dtype: float64

In [9]:
days_above_average = temperature_series[temperature_series > average_temp]
days_above_average

Monday       23
Tuesday      27
Wednesday    31
Friday       25
dtype: int64

In [10]:
# Problem 2
# 2. Create a data frame with details of 10 students and columns as
# Roll Number, Name, Gender, Marks1, Marks2, Marks3.
# a. Create a new column with total marks
# b. Find the lowest marks in Marks1
# c. Find the Highest marks in Marks2
# d. Find the average marks in Marks3
# e. Find student name with highest average
# f. Find how many students failed in Marks2 (<40)

In [11]:
data = {
    'Roll Number': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name': ['Ada', 'Alan', 'Grace', 'Linus', 'Tim', 
             'Margaret', 'Guido', 'Dennis', 'Katherine', 'Elon'],
    'Gender': ['F', 'M', 'F', 'M', 'M', 'F', 'M', 'M', 'F', 'M'],
    'Marks1': [85, 72, 90, 65, 88, 92, 78, 81, 95, 70],
    'Marks2': [45, 38, 50, 42, 55, 60, 35, 48, 52, 58],
    'Marks3': [75, 80, 85, 70, 90, 88, 82, 79, 92, 84]
}
df = pd.DataFrame(data)
df

   Roll Number       Name Gender  Marks1  Marks2  Marks3
0            1        Ada      F      85      45      75
1            2       Alan      M      72      38      80
2            3      Grace      F      90      50      85
3            4      Linus      M      65      42      70
4            5        Tim      M      88      55      90
5            6   Margaret      F      92      60      88
6            7      Guido      M      78      35      82
7            8     Dennis      M      81      48      79
8            9  Katherine      F      95      52      92
9           10       Elon      M      70      58      84

In [12]:
df['Total Marks'] = df['Marks1'] + df['Marks2'] + df['Marks3']
df

   Roll Number       Name Gender  Marks1  Marks2  Marks3  Total Marks
0            1        Ada      F      85      45      75          205
1            2       Alan      M      72      38      80          190
2            3      Grace      F      90      50      85          225
3            4      Linus      M      65      42      70          177
4            5        Tim      M      88      55      90          233
5            6   Margaret      F      92      60      88          240
6            7      Guido      M      78      35      82          195
7            8     Dennis      M      81      48      79          208
8            9  Katherine      F      95      52      92          239
9           10       Elon      M      70      58      84          212

In [13]:
lowest_marks1 = df['Marks1'].min()
print(f"Lowest marks in Marks1: {lowest_marks1}")

Lowest marks in Marks1: 65

In [14]:
highest_marks2 = df['Marks2'].max()
print(f"Highest marks in Marks2: {highest_marks2}")

Highest marks in Marks2: 60

In [15]:
average_marks3 = df['Marks3'].mean()
print(f"Average marks in Marks3: {average_marks3}")

Average marks in Marks3: 82.5

In [16]:
df['Average Marks'] = df[['Marks1', 'Marks2', 'Marks3']].mean(axis=1)
student_highest_avg = df.loc[df['Average Marks'].idxmax(), 'Name']
print(f"Student with the highest average: {student_highest_avg}")

Student with the highest average: Margaret

In [17]:
failed_students = df[df['Marks2'] < 40].shape[0]
failed_students

2